/**
 * Перебор всех узлов без доп. памяти.
 *
 * Time: O(N) | Space: O(1)
 */
function swapPairs(head) {
  // Используем узел-заглушку, чтобы было просто обрабатывать первый узел.
  const sentinel = new ListNode(0, head)

  let prev = sentinel
  let curr = sentinel.next

  while (curr && curr.next) {
    // Сохраняем узлы для перестановки в отдельные переменные.
    const first = curr
    const second = curr.next

    // Следующие два узла после prev поменяются местами,
    // поэтому меняем ссылку prev на тот узел,
    // который встанет на место следующего.
    prev.next = first.next

    // Меняем местами узлы.
    // После перестановки первый узел будет ссылаться на новый узел,
    // а второй — на первый.
    first.next = second.next
    second.next = first

    // Передвигаем оба указателя.
    // Текущий указатель передвигаем всего на один узел вперёд,
    // потому что в ходе замены он уже сместился на один узел.
    prev = first
    curr = first.next
  }

  // Возвращаем первый настоящий узел, второй после заглушки.
  return sentinel.next
}
